{"source": "breeder",
  "questions_attributes":[
  {
    "content": "Are you allowed to visit where the puppies are kept?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text": "Yes! This is the most important step in getting a dog! Visiting is the only way to know for sure what kind of place a puppy is coming from."
    },
    {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Uh oh… Visiting is the only way to know for sure what kind of place a puppy is coming from. If this breeder will not let you visit, what could they be hiding?"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"This is the most important step in getting a dog! Visiting is the only way to know for sure what kind of place a puppy is coming from. Definitely find out whether or not this is allowed."
    }
    ]
  },
  {
    "content": "Does the breeder ship puppies via airplane?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text": "Yikes! An unsupervised flight is a potentially scary and dangerous experience. Check out other breeders or shelters that don’t ship their precious pups as cargo."
    },
    {
      "o_content": "No",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text": "Great! A flight is a potentially scary and dangerous experience. Not shipping young pups is a good breeder decision!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text": "A flight is a potentially scary and dangerous experience. Steer clear of any breeder who offers to ship you a pup!"
    }
    ]
  },
  {
    "content": "Is the breeder United States Department of Agriculture (USDA) licensed?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"The USDA oversees *farms*. **If a breeder is USDA licensed, they are a puppy farm**. (AKA puppy mill) This puts your pup at high risk for health and behavior problems."
    },
    {
      "o_content": "No",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Excellent! The USDA oversees farms. If a breeder is USDA licensed, they are a puppy farm! Not having this license is a GOOD thing."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"The USDA oversees farms. **If a breeder is USDA licensed, they are a puppy farm!** Keep your eyes open for this and steer clear of any ‘breeders’ with this license."
    }
    ]},
  {
    "content": "Where are the puppies being raised?",
    "options_attributes": [{
      "o_content": "In the home with the family",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Woo hoo! Puppies need good experiences (socialization) with the things they will encounter as adults. Being raised in a home is the ideal way to prepare for life as a family pet."
    }, {
      "o_content": "In a warehouse/rows of cages",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Yikes, it’s time to walk away, as hard as it might be. Puppies need lots of good experiences (socialization) with the things they will encounter as adults. Being raised in a warehouse environment makes them more prone to fearful and aggressive behaviors as adults."
    }, {
      "o_content": "In a kennel or garage",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"This answer isn’t a great sign… Puppies need lots of good experiences (socialization) with the things they will encounter as adults. Pups raised outside of a home are more prone to fearful and aggressive behaviors as adults."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text": "Puppies need good experiences (socialization) with the things they will encounter as adults. Pups raised outside of a home are more prone to fearful and aggressive behaviors. It’s worth digging to find out the answer to this."
    }]
  },
  {
    "content": "Are the puppies seen by a veterinarian prior to going home?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Anybody selling puppies should have them examined by a licensed vet. Vets can find mild problems like hernias and major ones like neurological conditions. It’s great that this breeder is being responsible!"
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Anybody selling puppies should have them examined by a licensed vet. It’s a huge risk (emotionally and financially) to buy a puppy who might already have a serious health problem."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Anybody selling puppies should have them examined by a licensed vet. It’s a huge risk (emotionally and financially) to buy a puppy who might already have a health problem."
    }]
  },
  {
    "content": "Will the breeder take your dog back at any point if you cannot keep him/her",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Great! Responsible breeders take their pups back at any point."
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Responsible breeders take their pups back at any point. Not offering this is a sign you might be faced with a lack of support when you need it most!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Responsible breeders take their pups back at any point. Avoid breeders who won't, it’s a sign you might not have support when you need it most!"
    }]
  },
  {
    "content": "Does the breeder require you to meet them in person?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Fantastic! Responsible breeders want to meet you and make sure their pups are going to a good home. "
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Oh dear… Responsible breeders want to meet you and make sure their pups are going to a good home. If a breeder will sell you a puppy knowing only your credit card info, that’s a red flag!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"Responsible breeders want to meet you and make sure their pups are going to a good home. If a breeder will sell you a puppy knowing only your credit card info, that’s a red flag!"
    }]
  },
  {
    "content": "How many breeds does the breeder have available?",
    "options_attributes": [{
      "o_content": "1-2",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"This is a good sign. The more breeds a breeder has available, the more likely they are to be a puppy farm."
    }, {
      "o_content": "3",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text": "The more breeds a breeder has available, the more likely they are to be a puppy farm or to sell puppies from puppy farms. See the breeder and home in person to verify they are reputable."
    }, {
      "o_content": "4 or more",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Not so good! The more breeds a breeder has available, the more likely they are to be a puppy farm or to sell puppies from puppy farms. Steer clear of places offering 4 or more breeds."
    }]
  },
  {
    "content": "Does the breeder provide proof that both parents are screened for health problems (hip dysplasia, heart problems, etc.)?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Bravo! Good breeders always have their parent dogs checked for health problems common to their breed. Check out [this list] (http://www.caninehealthinfo.org/breeds.html) to see what your breeder should be screening for. Proof can be in the form of a special number, called a CHIC number, that you can look up on [this website] (http://www.caninehealthinfo.org/search.html)."
    }, {
      "o_content": "No",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"This is a big part of why you would pay somebody money for a puppy! Check out [this list] (http://www.caninehealthinfo.org/breeds.html) to see what your breeder should be screening for."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"Hmm…. Good breeders always have their breeding dogs checked for health problems common to their breed. Check out [this list] (http://www.caninehealthinfo.org/breeds.html) to see what your breeder should be screening for."
    }]
  },
  {
    "content": "How much do puppies cost?",
    "options_attributes": [{
      "o_content": "Up to $2000",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"It’s not uncommon for breeders to charge within this range for pet puppies. If you are paying closer to $2,000, the parents should absolutely have health testing results. To see what tests your breed should have, check out [this list] (http://www.caninehealthinfo.org/breeds.html)."
    }, {
      "o_content": "Between $2000 and $3000 ",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"This is on the very high end of what good breeders charge for pet puppies. What are you paying for? Make sure all health tests have been done on the parent dogs. To see what tests your breed should have, check out [this list] (http://www.caninehealthinfo.org/breeds.html)."
    }, {
      "o_content": "Over $3000",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Woof! Unless you are looking for a competitive show puppy (not just a pet), it’s unlikely that a reputable breeder would charge this much! Best to look elsewhere..."
    }]
  }
]
}
