{"source": "shelter",
  "questions_attributes": [
  {
    "content": "Is this a ’no-kill’ or limited-admissions shelter/rescue?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "yellow",
      "avail_points": 10,
      "feedback_text":"There are many terms for shelters and rescues, and they can be confusing! These terms are NOT linked to the quality of the organization. Some terms can make them sound very appealing (like ‘no-kill’) while others might scare you (like ‘kill shelter’, sometimes used to refer to an open-admission shelter). Some of the best shelters out there are open admission! The other factors in this quiz are a much better measure of quality."
    }, {
      "o_content": "No",
      "o_color": "yellow",
      "avail_points": 10,
      "feedback_text":"There are many terms for shelters and rescues, and they can be confusing! These terms are NOT linked to the quality of the organization. Some terms can make them sound very appealing (like ‘no-kill’) while others might scare you (like ‘kill shelter’, sometimes used to refer to an open-admission shelter). Some of the best shelters out there are open admission! The other factors in this quiz are a much better measure of quality."
    }, {
      "o_content": "I don't know / other",
      "o_color": "yellow",
      "avail_points": 10,
      "feedback_text":"There are many terms for shelters and rescues, and they can be confusing! These terms are NOT linked to the quality of the organization. Some terms can make them sound very appealing (like ‘no-kill’) while others might scare you (like ‘kill shelter’, sometimes used to refer to an open-admission shelter). Some of the best shelters out there are open admission! The other factors in this quiz are a much better measure of quality."
    }]
  },
  {
    "content": "Does the shelter/rescue adopt out dogs directly over the internet? (You adopt online and they transport the dog to you.)",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Yikes! Poorly run shelters/rescues will adopt out dogs that have significant behavior or health problems without telling you. If you don’t meet the dog before you adopt her, you have no way of knowing for sure what she’s like."
    }, {
      "o_content": "No, and they explicitly state this",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Woo! This is a very good sign. Poorly run shelters/rescues will adopt out dogs that have significant behavior or health problems without telling you. Good places will require you to come meet the dog first."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Poorly run shelters/rescues will adopt out dogs that have significant behavior or health problems without telling you. If you don’t meet the dog before you adopt her, you have no way of knowing for sure what she’s like."
    }]
  },
  {
    "content": "Are you allowed to visit where the dogs are kept?",
    "options_attributes": [{

      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Yes! This is the most important step in getting a dog! Visiting is the only way to know for sure what kind of place a dog is coming from. It’s great that this shelter/rescue welcomes you to visit."
    }, {
      "o_content": "No, and it’s a shelter with a building",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Uh oh… Visiting is the only way to know for sure what kind of place a dog is coming from. If this shelter will not let you visit, what could they be hiding?"
    }, {
      "o_content": "No, and it’s a rescue",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"Hmm… Visiting is the only way to know for sure what kind of place a dog is coming from. Rescues often have their dogs in foster homes, and foster owners may not want strangers in their homes. Meeting in a public place can sometimes be okay, but it can also be risky!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Hmm… Visiting is the only way to know for sure what kind of place a dog is coming from. Rescues often have their dogs in foster homes, and the foster owners may not want strangers in their homes. Meeting in a public place can sometimes be okay, but it can also be risky!"
    }]
  },
  {
    "content": "Does the shelter perform temperament (personality) tests/aggression screenings?",
    "options_attributes": [{
      "o_content": "Yes, they use the SAFER test or Assess-A-Pet",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Excellent! These screenings test to see if a dog shows signs of aggression in common situations. (They’re not a guarantee, but science shows they really help!)"
    }, {
      "o_content": "Yes, they use their own methods",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"The quality of “custom” methods for assessing dog aggression varies greatly and we don’t know how accurate they are. Also, not every shelter/rescue has the resources to formally test all of their dogs."
    }, {
      "o_content": "No, or they just “go by feel”",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Formal screenings test to see if a dog shows signs of aggression in common situations. It’s very risky to adopt a dog who hasn’t had a behavior evaluation. Look for a shelter/rescue that screens dogs."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Ask the shelter/rescue and find out! The SAFER test and Assess-A-Pet test to see if a dog shows signs of aggression in common situations. (They’re not a guarantee, but science shows they really help!)"
    }]
  },
  {
    "content": "Does the shelter/rescue require you to meet them in person?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Fantastic! Good organizations want to meet you. Expect to fill out an adoption application and talk to an adoption counselor."
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -100,
      "feedback_text":"Oh dear… Responsible shelters and rescues want to meet you. If they will adopt to you knowing only your credit card info, that’s a red flag!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"This is a good one to find out! Responsible shelters and rescues want to meet you. Expect to fill out an adoption application and talk to an adoption counselor. If they will adopt to you knowing only your credit card info, that’s a red flag!"
    }]
  },
  {
    "content": "Where are the puppies being raised?",
    "options_attributes": [{
      "o_content": "In the home with the family",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Woo hoo! Puppies need good experiences (socialization) with the things they will encounter as adults. Being raised in a home is the ideal way to prepare for life as a family pet."
    }, {
      "o_content": "In very crowded and/or dirty conditions",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Uh oh. Puppies need lots of good experiences (socialization) with the things they will encounter as adults. Pups raised in poor conditions are more prone to fearful and aggressive behaviors as adults. Look elsewhere."
    }, {
      "o_content": "In a kennel, garage, or outdoors",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"This can be a risk for young pups. Puppies need lots of good experiences (socialization) with the things they will encounter as adults. Pups raised outside of a home are more prone to fearful and aggressive behaviors as adults. Adult dogs in kennels don’t face the same risks, they’re already developed! Have you considered adopting an adult?"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Puppies need good experiences (socialization) with the things they will encounter as adults. Pups raised outside of a home are more prone to fearful and aggressive behaviors. It’s worth digging to find out the answer to this."
    }, {
      "o_content": "Not applicable, I’m looking for a dog over 4 months old",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"We’re excited you’re looking to adopt a teenager or adult! These dogs don’t face the same risks as young puppies do, since they’re already past their socialization period!"
    }]
  },
  {
    "content": "Are the dogs seen by a veterinarian prior to adoption?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Excellent! Adoptable dogs should be examined by a licensed vet. The dogs should also be tested for heartworm. It’s great that this shelter/rescue is being responsible!"
    }, {
      "o_content": "No, but the shelter/rescue vaccinates them",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"Vaccines are a good start. Adoptable dogs are ideally examined by a licensed vet. It’s a risk (emotionally and financially) to adopt a dog who might already have a health problem. "
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"All reputable shelters/rescues vaccinate their dogs prior to adoption! Ideally, dogs should be examined by a licensed vet. It’s a huge risk (emotionally and financially) to adopt an unvaccinated dog who might already have a health problem."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Adoptable dogs should be examined by a licensed vet. It’s a huge risk (emotionally and financially) to adopt a dog who might already have a health problem."
    }]
  },
  {
    "content": "Will the shelter/rescue take your adopted dog back if things don't work out?",
    "options_attributes": [{
      "o_content": "Yes",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Responsible shelters and rescues are committed to the dogs they adopt out. Most take their dogs back at any point."
    }, {
      "o_content": "No",
      "o_color": "yellow",
      "avail_points": -10,
      "feedback_text":"Some places just don’t have the resources to be able to take adopted dogs back in. Others are truly bad places and may be scamming you. If you can’t bring your dog back, this means you might be faced with a lack of support when you need it most!"
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Responsible shelters and rescues are committed to the dogs they adopt out. Most take their dogs back at any point. If you can’t bring your dog back, this means you might be faced with a lack of support when you need it most!"
    }]
  },
  {
    "content": "Has the shelter socialized the puppies to people, objects, and a normal home environment?",
    "options_attributes": [{
      "o_content": "Yes, and they are raised in a home",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"Woo hoo! Puppies need good experiences (socialization) with the things they will encounter as adults. They can grow up to be fearful of things they aren’t used to. Being raised in a home is the ideal way to prepare for life as a family pet."
    }, {
      "o_content": "Yes, and they are raised inside the shelter",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Puppies need good experiences (socialization) with the things they will encounter as adults. A well-run shelter will expose their pups to homes or home-like environments. This isn’t as ideal as being in a foster home, and carries some bigger risks."
    }, {
      "o_content": "No",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text": "Puppies need good experiences (socialization) with the things they will encounter as adults. Some shelters do not have the time or people available to do this. It’s good to recognize there is the potential for increased risk of behavior problems when young pups don’t grow up in a home-like environment."
    }, {
      "o_content": "Not applicable, I’m looking for a dog over 4 months old",
      "o_color": "green",
      "avail_points": 10,
      "feedback_text":"We’re excited you’re looking to adopt a teenager or adult! These dogs don’t face the same risks as young puppies do, since they’re already past their socialization period! "
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Puppies need good experiences (socialization) with the things they will encounter as adults. Being raised in a home is the ideal way to prepare for life as a family pet. It’s worth digging to find out the answer to this question!"
    }]
  },
  {
    "content": "What is the adoption fee?",
    "options_attributes": [{
      "o_content": "Over $350",
      "o_color": "red",
      "avail_points": -30,
      "feedback_text":"Uh oh! Normal adoption fees range from about $50 up to about $350. Going much higher than that is a red flag that the organization could be trying to make money off of adoptions, and may not even be a real shelter/rescue at all."
    }, {
      "o_content": "$0-350",
      "o_color": "green",
      "avail_points": 20,
      "feedback_text":"Normal adoption fees range from about $50 all the way up to about $350. Usually, this is a very reasonable range for reputable places."
    }, {
      "o_content": "I don't know",
      "o_color": "yellow",
      "avail_points": 0,
      "feedback_text":"Normal adoption fees range from about $50 all the way up to about $350. More than this and you may be being scammed! Keep your eyes peeled for appropriate adoption fees."
    }]
  }
]
}